In [117]:
import numpy as np
import pandas as pd

s= pd.Series([1, 2, 3, 'hello', np.nan, 4, 5])
s

0        1
1        2
2        3
3    hello
4      NaN
5        4
6        5
dtype: object

In [116]:
dates = pd.date_range("20160201", periods=6)
dates

DatetimeIndex(['2016-02-01', '2016-02-02', '2016-02-03', '2016-02-04',
               '2016-02-05', '2016-02-06'],
              dtype='datetime64[us]', freq='D')

In [115]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns=list("ABCD"))
df

                   A         B         C         D
2016-02-01  1.496194  0.825664  1.286501  0.453986
2016-02-02 -0.476067  2.617637  0.095228  0.214904
2016-02-03  0.396734 -0.213869 -1.624358  0.143935
2016-02-04  1.320554  1.092690  0.157043 -0.900642
2016-02-05 -0.847044  1.332478  0.332334 -1.672799
2016-02-06  0.879962  0.289576  1.155782 -0.057652

In [ ]:
#pandas dataframe has one datatype per column
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20160212"),
        "C": pd.Series(1, index=list(range(10)), dtype= "float32"),
        "D": np.array([3]*10, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train","test","train","test","test","train", "train"]),
        "F": "foo"
    }
)
df2

     A          B    C  D      E    F
0  1.0 2016-02-12  1.0  3   test  foo
1  1.0 2016-02-12  1.0  3  train  foo
2  1.0 2016-02-12  1.0  3   test  foo
3  1.0 2016-02-12  1.0  3  train  foo
4  1.0 2016-02-12  1.0  3   test  foo
5  1.0 2016-02-12  1.0  3  train  foo
6  1.0 2016-02-12  1.0  3   test  foo
7  1.0 2016-02-12  1.0  3   test  foo
8  1.0 2016-02-12  1.0  3  train  foo
9  1.0 2016-02-12  1.0  3  train  foo

In [ ]:
df2.dtypes

A           float64
B    datetime64[us]
C           float32
D             int32
E          category
F               str
dtype: object

In [111]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2016-02-12  1.0  3   test  foo
1  1.0 2016-02-12  1.0  3  train  foo

In [112]:
df2.tail(2)

     A          B    C  D      E    F
8  1.0 2016-02-12  1.0  3  train  foo
9  1.0 2016-02-12  1.0  3  train  foo

In [109]:
df2.index

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [108]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='str')

In [107]:
df2.to_numpy #convert to numpy object

<bound method DataFrame.to_numpy of      A          B    C  D      E    F
0  1.0 2016-02-12  1.0  3   test  foo
1  1.0 2016-02-12  1.0  3  train  foo
2  1.0 2016-02-12  1.0  3   test  foo
3  1.0 2016-02-12  1.0  3  train  foo
4  1.0 2016-02-12  1.0  3   test  foo
5  1.0 2016-02-12  1.0  3  train  foo
6  1.0 2016-02-12  1.0  3   test  foo
7  1.0 2016-02-12  1.0  3   test  foo
8  1.0 2016-02-12  1.0  3  train  foo
9  1.0 2016-02-12  1.0  3  train  foo>

In [105]:
df2.describe

<bound method NDFrame.describe of      A          B    C  D      E    F
0  1.0 2016-02-12  1.0  3   test  foo
1  1.0 2016-02-12  1.0  3  train  foo
2  1.0 2016-02-12  1.0  3   test  foo
3  1.0 2016-02-12  1.0  3  train  foo
4  1.0 2016-02-12  1.0  3   test  foo
5  1.0 2016-02-12  1.0  3  train  foo
6  1.0 2016-02-12  1.0  3   test  foo
7  1.0 2016-02-12  1.0  3   test  foo
8  1.0 2016-02-12  1.0  3  train  foo
9  1.0 2016-02-12  1.0  3  train  foo>

In [104]:
df2.T    #Transpose dataframe

,0,1,2,3,4,5,6,7,8,9
A,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
B,2016-02-12 00:00:00,2016-02-12 00:00:00,2016-02-12 00:00:00,2016-02-12 00:00:00,2016-02-12 00:00:00,2016-02-12 00:00:00,2016-02-12 00:00:00,2016-02-12 00:00:00,2016-02-12 00:00:00,2016-02-12 00:00:00
C,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
D,3,3,3,3,3,3,3,3,3,3
E,test,train,test,train,test,train,test,test,train,train
F,foo,foo,foo,foo,foo,foo,foo,foo,foo,foo

In [103]:
df.sort_index(axis=0, ascending=False)#axis 0 row index, axis = 1 column index

                   A         B         C         D
2016-02-06  0.717419  0.770614 -1.961181 -0.041430
2016-02-05  1.298142  1.802384  0.426180 -1.561655
2016-02-04  0.242810  1.531996  0.071725  0.705803
2016-02-03  0.107817  0.877516  0.675637  0.581310
2016-02-02  1.426052  1.073123  0.203526  2.005013
2016-02-01 -0.108078 -0.037904  0.138172  0.132807

In [89]:
df.sort_values(by='B')

                   A         B         C         D
2016-02-01 -0.108078 -0.037904  0.138172  0.132807
2016-02-06  0.717419  0.770614 -1.961181 -0.041430
2016-02-03  0.107817  0.877516  0.675637  0.581310
2016-02-02  1.426052  1.073123  0.203526  2.005013
2016-02-04  0.242810  1.531996  0.071725  0.705803
2016-02-05  1.298142  1.802384  0.426180 -1.561655

In [ ]:
df.A #get column A data

2016-02-01   -0.108078
2016-02-02    1.426052
2016-02-03    0.107817
2016-02-04    0.242810
2016-02-05    1.298142
2016-02-06    0.717419
Freq: D, Name: A, dtype: float64

In [98]:
df["A"]

2016-02-01   -0.108078
2016-02-02    1.426052
2016-02-03    0.107817
2016-02-04    0.242810
2016-02-05    1.298142
2016-02-06    0.717419
Freq: D, Name: A, dtype: float64

In [101]:
df[["A","D"]]

                   A         D
2016-02-01 -0.108078  0.132807
2016-02-02  1.426052  2.005013
2016-02-03  0.107817  0.581310
2016-02-04  0.242810  0.705803
2016-02-05  1.298142 -1.561655
2016-02-06  0.717419 -0.041430

In [102]:
df[0:3]

                   A         B         C         D
2016-02-01 -0.108078 -0.037904  0.138172  0.132807
2016-02-02  1.426052  1.073123  0.203526  2.005013
2016-02-03  0.107817  0.877516  0.675637  0.581310

In [ ]:
df.loc[dates[0]] #select a row matching label

1.496194054028113

In [ ]:
df.loc[:,["A","B"]] #select all rows :

                   A         B
2016-02-01  1.496194  0.825664
2016-02-02 -0.476067  2.617637
2016-02-03  0.396734 -0.213869
2016-02-04  1.320554  1.092690
2016-02-05 -0.847044  1.332478
2016-02-06  0.879962  0.289576

In [123]:
df.loc["20160201":"20160204", ["A", "B"]]

                   A         B
2016-02-01  1.496194  0.825664
2016-02-02 -0.476067  2.617637
2016-02-03  0.396734 -0.213869
2016-02-04  1.320554  1.092690

In [124]:
df.loc[["20160201","20160203"],["A","B"]]

                   A         B
2016-02-01  1.496194  0.825664
2016-02-03  0.396734 -0.213869

In [125]:
df.loc[dates[0],["A"]]

A    1.496194
Name: 2016-02-01 00:00:00, dtype: float64

In [ ]:
df.at["20160204","A"] #when we need only one value

1.3205543109489692

In [ ]:
df.iloc[0:5, 0:4] #rows 0 tp 4 and columns 0 to 3

                   A         B         C         D
2016-02-01  1.496194  0.825664  1.286501  0.453986
2016-02-02 -0.476067  2.617637  0.095228  0.214904
2016-02-03  0.396734 -0.213869 -1.624358  0.143935
2016-02-04  1.320554  1.092690  0.157043 -0.900642
2016-02-05 -0.847044  1.332478  0.332334 -1.672799

In [ ]:
df.iloc[:,0:2] #all rows, column 0 and 1

                   A         B
2016-02-01  1.496194  0.825664
2016-02-02 -0.476067  2.617637
2016-02-03  0.396734 -0.213869
2016-02-04  1.320554  1.092690
2016-02-05 -0.847044  1.332478
2016-02-06  0.879962  0.289576

In [139]:
df.iloc[[0,2],[1,3]]

                   B         D
2016-02-01  0.825664  0.453986
2016-02-03 -0.213869  0.143935

In [ ]:
selecting rows where df.A is greater than 0
df[df.A > 1]

                   A         B         C         D
2016-02-01  1.496194  0.825664  1.286501  0.453986
2016-02-04  1.320554  1.092690  0.157043 -0.900642

In [ ]:
#selecting value from dataframe where boolean condition is met
df[df>0]

                   A         B         C         D
2016-02-01  1.496194  0.825664  1.286501  0.453986
2016-02-02       NaN  2.617637  0.095228  0.214904
2016-02-03  0.396734       NaN       NaN  0.143935
2016-02-04  1.320554  1.092690  0.157043       NaN
2016-02-05       NaN  1.332478  0.332334       NaN
2016-02-06  0.879962  0.289576  1.155782       NaN

In [151]:
df["E"] = ["one", "two", "three", "four", "five", "six"]
df[df["E"].isin (["one","four"])]

                   A         B         C         D     E
2016-02-01  1.496194  0.825664  1.286501  0.453986   one
2016-02-04  1.320554  1.092690  0.157043 -0.900642  four